{
    "TrackingCodeCustomizer": {
        "PluginDescription":"The provided values will replace the defaults in the generated tracking code (leave blank to use defaults). Viewing https://github.com/piwik/piwik/blob/master/core/Tracker/TrackerCodeGenerator.php is recommended to deconstruct how the tracking code is built.",

        "idSiteSettingTitle":"The siteId that will be included in the tracking code.",
        "idSiteSettingHelp": "Probably not useful in most scenarios. The idSite option is included for completeness.",

        "protocolSettingTitle":"Piwik default URL protocol",
        "protocolSettingHelp":"eg. http(s):// - allows to set the default protocol instead of the protocol relative URL",

        "piwikUrlSettingTitle":"The tracker URL to use.",
        "piwikUrlSettingHelp":"eg. 'tracker.example.com/piwik' use hostname + basepath only (omit protocol and trailing slash)",

        "httpsPiwikUrlSettingTitle":"HTTPS tracker URL (if different from normal domain)",
        "httpsPiwikUrlSettingHelp":"Set if the HTTPS domain is different from the normal domain. Example: 'tracker.example.com/piwik' use hostname + basepath only (omit protocol and trailing slash)",

        "piwikJsSettingTitle": "piwik.js Filename",
        "piwikJsSettingHelp": "Let's you customize the piwik.js Filename. This is useful to avoid detections by AdBlockers. Don't forget to create a rewrite rrule accordingly in your web-server configuration: RewriteRule \"^/p/p.(js|php)$\" \"/piwik/piwik.$1\" [PT,L]",

        "piwikPhpSettingTitle": "piwik.php Filename",
        "piwikPhpSettingHelp": "Let's you customize the piwik.php Filename. This is useful to avoid detections by AdBlockers. Don't forget to create a rewrite rrule accordingly in your web-server configuration: RewriteRule \"^/p/p.(js|php)$\" \"/piwik/piwik.$1\" [PT,L]",

        "paqVariableSettingTitle": "Name for _paq in Javascript tracking code",
        "paqVariableSettingHelp": "Let's you customize the _paq JS Variable in your tracking code. This can be useful to avoid issues with multiple Piwik tracking codes on the same page.",

        "removePiwikBrandingSettingTitle": "Remove Piwik branding comments in tracking code",
        "removePiwikBrandingSettingHelp": "Remove the comments containing 'Piwik' out of the standard tracking code",

        "optionsSettingTitle":"Code options",
        "optionsSettingDescription":"A string of JavaScript code that customizes the JavaScript tracker (after _paq = _paq || [] and before trackPageView).",

        "optionsBeforeTrackerUrlSettingTitle":"Code options before tracker URL",
        "optionsBeforeTrackerUrlSettingDescription":"A string of Javascript code that customizes the JavaScript tracker inside of anonymous function before adding setTrackerUrl into paq.",

        "writePermissionInfoText": "WARNING: %PIWIK_INCLUDE_PATH%/piwik.js is not writeable by the webserver. If you'd like to use the following settings, please change the permissions of the file or apply the changes manually."
    }
}